#ifndef DATA_H_
#define DATA_H_


/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */
#include "dev_at24c256.h"
#include "Config.h"
#include "dri_delay.h"

/* ------------------------------------------------------------------------------------------------
 *                                          Define
 * ------------------------------------------------------------------------------------------------
 */

/******************状态标识*********************/
#define DATA_OK                   1     //操作成功
#define DATA_EXIST                2     //数据已经存在
#define DATA_FULL                 3     //存储容量已满
#define DATA_NULL                 4     //存储容量已空
#define DATA_ERR                  0     //操作失败



/* ------------------------------------------------------------------------------------------------
 *                                          Application
 * ------------------------------------------------------------------------------------------------
 */
uint8 Data_Door_Init(void);
uint8 Data_CommonCard_Init(void);
//void Data_DoorID_Init(void);


void Data_DoorID_Read(uint8 *DoorId);

uint8 Data_CommonCard_Auth(uint8 *CardId);
uint8 Data_CommonCard_UnAuth(uint8 *CardId);
uint8 Data_CommonCard_Confirm(uint8 *CardId);

/* ------------------------------------------------------------------------------------------------
 *                                          Prototypes
 * ------------------------------------------------------------------------------------------------
 */
uint8 Data_Storage(uint8 *WriteId, uint16 WriteAddr);


#endif