#define DRI_IPORT_C

#include "dri_iport.h"


/**************************************************************************************************
 * @fn          Iport_Init
 * @brief       Iport端口初始化
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void Iport_Init(void)
{
  P0SEL &= ~0x12;   //设置P0.1、P0.4为通用I/O口  | PXSEL: 0.通用 1.外设
  
  P0DIR |=  0x02;   //设置P0.1为输出       | PXDIR: 0:输入 1.输出
  P0INP &= ~0x02;   //设置成上拉，也可以起到限流作用 
  
  P0DIR &= ~0x10;   //设置P0.4为输入       | PXDIR: 0:输入 1.输出
  P0INP &= ~0x10;   //设置成上拉，也可以起到限流作用 

  RST    =  1;      //高电平不复位 
}

