#define DRI_ADC_C_

/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */
#include "dri_adc.h"



/**************************************************************************************************
 * @fn          Adc_Init
 * @brief       P0.0电池电压检测端口设置为模拟输入功能
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void Adc_Init(void)
{
  P0DIR &= ~0x01;    //P0_0定义为输入
  P0SEL |=  0x01;    //P0_0作为外设功能AIN0输入
  APCFG  =  0x01;    //P0_作为模拟外设I/O口
}


/**************************************************************************************************
 * @fn          Adc_Config
 * @brief       ADC转换配置
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void Adc_Config(void)
{
  ADCH    &= 0x00;
  ADCL    &= 0x00;
  
  ADCCON3  = 0x30;   //内部参考电压1.25V，12位有效数字，AIN0 ADC通道0
  ADCCON1 |= 0x30;   //停止A/D转换
  ADCCON1 |= 0x40;   //A/D转换开始
}


/**************************************************************************************************
 * @fn          Adc_GetVoltage
 * @brief       ADC转换配置,电池电压满量程6.48V，电阻R4 820K 电阻R4 220K
 * @param       无
 * @return      无
 **************************************************************************************************
 */

uint16 Adc_GetVoltage(void)
{
  uint16 AdcValue = 0x00;
  uint16 AdcSum   = 0x00;
  uint16 Value    = 0x00;
  uint16 AdcH     = 0x00;
  uint8 i;

  
  for(i=0; i<5; i++)
  {
    Adc_Config();               //ADC单次触发配置
    while(!(ADCCON1 & 0x80));   //等待转换完成
    AdcValue  = ADCL >> 2;   
    AdcH      = ADCH;   
    AdcValue |= (AdcH << 6);
    AdcSum += AdcValue; 
    AdcH      = 0x00;
  }
  
  Value = AdcSum/5;
  
  return Value;
}
